bachelorarbeit/test2/tutorials/floatingObject/constant/setSubset/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    stationaryWalls
    {
        type            wall;
        nFaces          11200;
        startFace       277808;
    }
    atmosphere
    {
        type            patch;
        nFaces          1600;
        startFace       289008;
    }
    floatingObject
    {
        type            wall;
        nFaces          672;
        startFace       290608;
    }
)


// ************************************************************************* //
